app/controllers/ingredients_controller.rb

    def index
        ingredients = Ingredient.all
---
SELECT `ingredients`.* FROM `ingredients`

    def create
        ingredient = Ingredient.new(ingredient_params)
        if ingredient.save
---
INSERT INTO "ingredients" ("recipe_id", "name", "measurement", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["recipe_id", 4], ["name", "asdf"], ["measurement", "asdf"], ["created_at", "2020-03-16 18:47:27.657195"], ["updated_at", "2020-03-16 18:47:27.657195"]]

    def update
        ingredient = Ingredient.find_by_id(params[:id])
        if ingredient.update(ingredient_params)
---
SELECT "ingredients".* FROM "ingredients" WHERE "ingredients"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE `ingredients` SET `ingredients`.`name` = 'Margrine 1', `ingredients`.`measurement` = '2 grams', `ingredients`.`updated_at` = '2020-03-12 18:45:18.307045' WHERE `ingredients`.`id` = 12

    def destroy
        ingredient = Ingredient.find_by_id(params[:id])
        if (!ingredient)
            render json: { success: false, errors: ingredient.errors.full_messages }
        else
            ingredient.destroy
---
SELECT "ingredients".* FROM "ingredients" WHERE "ingredients"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "ingredients" WHERE "ingredients"."id" = $1  [["id", 3]]