app/controllers/recipes_controller.rb

    def index
        recipes = Recipe.all
---
SELECT `recipes`.* FROM `recipes`

    def create
        recipe = Recipe.new(recipe_params)
        if recipe.save
---
INSERT INTO `recipes` (`user_id`, `name`, `description`, `created_at`, `updated_at`, `instruction`, `category`) VALUES (1, 'user1 recipe5', 'A nice description, this time with a category', '2020-03-06 18:06:00.328989', '2020-03-06 18:06:00.328989', 'Instructions on how to make the delicious recipe', 'cookie')

    def update
        recipe = Recipe.find_by_id(params[:id])
        if recipe.update(recipe_params)
---
SELECT `recipes`.* FROM `recipes` WHERE `recipes`.`id` = 37 LIMIT 1
UPDATE `recipes` SET `recipes`.`instruction` = 'Better Beef Instructions', `recipes`.`updated_at` = '2020-03-12 19:10:43.226930' WHERE `recipes`.`id` = 37

    def destroy
        recipe = Recipe.find_by_id(params[:id])
        if (!recipe)
            render json: { success: false, message: "Operation Failed" }
        else
            recipe.destroy
---
SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "recipes" WHERE "recipes"."id" = $1  [["id", 1]]